Обработки/Reports/_ПроцентныеДоходыФОГФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ПроцентныеДоходыФОГФ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ПроцентныеДоходыФОГФ/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет о доходах в виде процентов (ФОГФ)",
		"1.08",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение",	ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык",				ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект",			ЭтотОбъект.Организация);
	
	СтруктураКлюча.Вставить("КонтактноеЛицо", НастройкиОтчета.ПодписантРуководитель);
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхРуководитель", РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча));
	
	СтруктураКлюча.Вставить("КонтактноеЛицо", НастройкиОтчета.ПодписантГлавбух);
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхГлавбух", РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча));
	
	СписокДокументов = Новый Структура;
	СписокДокументов.Вставить("ДокументГос",	Новый ТабличныйДокумент);
	СписокДокументов.Вставить("ДокументКорп15", Новый ТабличныйДокумент);
	СписокДокументов.Вставить("ДокументКорп20", Новый ТабличныйДокумент);
	
	Сформировать(СписокДокументов);
	
	КнигаЭксель = Новый ПакетОтображаемыхДокументов;
	
	Элемент1 = КнигаЭксель.Состав.Добавить(ПоместитьВоВременноеХранилище(СписокДокументов.ДокументГос, Новый УникальныйИдентификатор));
	Элемент1.Наименование = "Государственные";
	
	Если ЭтотОбъект.Период.ДатаОкончания>= '20250101' Тогда 
		Ставка = 15;
	Иначе         
		Ставка = 20;
	КонецЕсли;
	
	Элемент2 = КнигаЭксель.Состав.Добавить(ПоместитьВоВременноеХранилище(СписокДокументов.ДокументКорп15, Новый УникальныйИдентификатор));
	Элемент2.Наименование = "Корпоративные по ставке " + Формат(Ставка, "ЧЦ=2") + "%";
	
	Элемент3 = КнигаЭксель.Состав.Добавить(ПоместитьВоВременноеХранилище(СписокДокументов.ДокументКорп20, Новый УникальныйИдентификатор));
	Элемент3.Наименование = "Корпоративные по ставке " + Формат(Ставка + 5, "ЧЦ=2") + "%";
	
	НастройкиОтчета.Вставить("Результат", КнигаЭксель);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ПодписантРуководитель");
	Настройки.Добавить("ПодписантГлавбух");	
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции

Функция РезультатЗапроса()	
	
	// В запросе специально не использовалась виртуальная таблица БухПартииЦенныхБумаг.Обороты или БухПартииЦенныхБумаг.ОстаткиИОбороты. Отбор по регистраторам 
	// и соединение записей регистра БухПартииЦенныхБумаг работает за месяц в 3-4 раза быстрее чем эти виртуальные таблицы
	
	
	Запрос = Новый Запрос;
	запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходов КАК АналитикаДоходов,
	|	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовПоследнееПогашение КАК АналитикаДоходовПоследнееПогашение,
	|	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтРеализации КАК АналитикаДоходовОтРеализации,
	|	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходовОтПереоценки КАК АналитикаДоходовОтПереоценки
	|ПОМЕСТИТЬ _НастройкиУчетаАктивов
	|ИЗ
	|	РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
	|				И УчетныйАктив В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон), ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон))
	|				И АналитикаДоходов <> ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)) КАК НастройкиУчетаАктивовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_НастройкиУчетаАктивов.АналитикаДоходов КАК Аналитика,
	|	""Погашение"" КАК Операция
	|ПОМЕСТИТЬ _АналитикиДоходов
	|ИЗ
	|	_НастройкиУчетаАктивов КАК _НастройкиУчетаАктивов
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	_НастройкиУчетаАктивов.АналитикаДоходовПоследнееПогашение,
	|	""Погашение""
	|ИЗ
	|	_НастройкиУчетаАктивов КАК _НастройкиУчетаАктивов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_НастройкиУчетаАктивов.АналитикаДоходовОтРеализации,
	|	""Реализация""
	|ИЗ
	|	_НастройкиУчетаАктивов КАК _НастройкиУчетаАктивов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_НастройкиУчетаАктивов.АналитикаДоходовОтПереоценки,
	|	""Переоценка""
	|ИЗ
	|	_НастройкиУчетаАктивов КАК _НастройкиУчетаАктивов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОперацииСЦеннымиБумагами.Регистратор КАК Регистратор,
	|	ОперацииСЦеннымиБумагами.Регистратор.МоментВремени КАК МоментВремени
	|ПОМЕСТИТЬ _Регистраторы
	|ИЗ
	|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
	|ГДЕ
	|	ОперацииСЦеннымиБумагами.Активность
	|	И ОперацииСЦеннымиБумагами.Организация = &Организация
	|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДУ
	|	И ОперацииСЦеннымиБумагами.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
	|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПереоценкаЦенныхБумаг.Ссылка,
	|	NULL
	|ИЗ
	|	Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
	|ГДЕ
	|	ПереоценкаЦенныхБумаг.Проведен
	|	И НЕ ПереоценкаЦенныхБумаг.ПометкаУдаления
	|	И ПереоценкаЦенныхБумаг.Организация = &Организация
	|	И ПереоценкаЦенныхБумаг.СчетДоверительногоУправления = &СчетДУ
	|	И ПереоценкаЦенныхБумаг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПереоценкаЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
	|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоНачальныйОстаток,
	|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток КАК СтоимостьКупонаВВалютеУчетаНачальныйОстаток,
	|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупонаВВалютеУчетаНачальныйОстаток,
	|	0 КАК СтоимостьКупонаВВалютеУчетаКонечныйОстаток,
	|	0 КАК КоличествоКонечныйОстаток,
	|	0 КАК КоличествоПриход,
	|	0 КАК СтоимостьКупонаВВалютеУчетаПриход,
	|	0 КАК КоличествоРасход,
	|	0 КАК СтоимостьКупонаВВалютеУчетаРасход,
	|	0 КАК ПереоценкаКупонаВВалютеУчетаПриход,
	|	0 КАК ПереоценкаКупонаВВалютеУчетаРасход,
	|	ВЫБОР
	|		КОГДА БухПартииЦенныхБумагОстатки.Партия.Дата < &НачалоПериода
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОстатки.Партия.Дата, ДЕНЬ)
	|	КОНЕЦ КАК ДатаПартии,
	|	NULL КАК Регистратор,
	|	&НачалоПериода КАК Период,
	|	&НачалоПериода КАК МоментВремени
	|ПОМЕСТИТЬ _ПартииВременная
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
	|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)) КАК БухПартииЦенныхБумагОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ЦеннаяБумага,
	|	ВложенныйЗапрос.Партия,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВложенныйЗапрос.КоличествоПриход,
	|	ВложенныйЗапрос.СтоимостьКупонаВВалютеУчетаПриход,
	|	ВложенныйЗапрос.КоличествоРасход,
	|	ВложенныйЗапрос.СтоимостьКупонаВВалютеУчетаРасход,
	|	ВложенныйЗапрос.ПереоценкаКупонаВВалютеУчетаПриход,
	|	ВложенныйЗапрос.ПереоценкаКупонаВВалютеУчетаРасход,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Партия.Дата < &НачалоПериода
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Партия.Дата, ДЕНЬ)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.Регистратор) = ТИП(Документ.СписаниеЦеннойБумаги)
	|			ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.Регистратор КАК Документ.СписаниеЦеннойБумаги).ПогашениеЦеннойБумаги
	|		ИНАЧЕ ВложенныйЗапрос.Регистратор
	|	КОНЕЦ,
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.МоментВремени
	|ИЗ
	|	(ВЫБРАТЬ
	|		БухПартииЦенныхБумаг.Регистратор КАК Регистратор,
	|		БухПартииЦенныхБумаг.МоментВремени КАК МоментВремени,
	|		БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|		БухПартииЦенныхБумаг.Партия КАК Партия,
	|		СУММА(ВЫБОР
	|				КОГДА БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА БухПартииЦенныхБумаг.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК КоличествоПриход,
	|		СУММА(ВЫБОР
	|				КОГДА БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					ТОГДА БухПартииЦенныхБумаг.Количество
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК КоличествоРасход,
	|		СУММА(ВЫБОР
	|				КОГДА БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК СтоимостьКупонаВВалютеУчетаПриход,
	|		СУММА(ВЫБОР
	|				КОГДА БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					ТОГДА БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК СтоимостьКупонаВВалютеУчетаРасход,
	|		СУММА(ВЫБОР
	|				КОГДА БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК ПереоценкаКупонаВВалютеУчетаПриход,
	|		СУММА(ВЫБОР
	|				КОГДА БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					ТОГДА БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК ПереоценкаКупонаВВалютеУчетаРасход,
	|		БухПартииЦенныхБумаг.Период КАК Период
	|	ИЗ
	|		_Регистраторы КАК _Регистраторы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
	|			ПО _Регистраторы.Регистратор = БухПартииЦенныхБумаг.Регистратор
	|				И (БухПартииЦенныхБумаг.Активность)
	|				И (БухПартииЦенныхБумаг.Период МЕЖДУ &НачалоПериода И &КонецПериода)
	|				И (БухПартииЦенныхБумаг.Организация = &Организация)
	|				И (БухПартииЦенныхБумаг.СчетДоверительногоУправления = &СчетДУ)
	|				И (БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет))
	|				И (БухПартииЦенныхБумаг.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации))
	|	ГДЕ
	|		БухПартииЦенныхБумаг.Активность
	|		И БухПартииЦенныхБумаг.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И БухПартииЦенныхБумаг.Организация = &Организация
	|		И БухПартииЦенныхБумаг.СчетДоверительногоУправления = &СчетДУ
	|		И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
	|		И БухПартииЦенныхБумаг.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БухПартииЦенныхБумаг.Регистратор,
	|		БухПартииЦенныхБумаг.МоментВремени,
	|		БухПартииЦенныхБумаг.Период,
	|		БухПартииЦенныхБумаг.ЦеннаяБумага,
	|		БухПартииЦенныхБумаг.Партия) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ПартииВременная.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_ПартииВременная.Партия КАК Партия,
	|	СУММА(_ПартииВременная.КоличествоНачальныйОстаток) КАК КоличествоНачальныйОстаток,
	|	СУММА(_ПартииВременная.СтоимостьКупонаВВалютеУчетаНачальныйОстаток) КАК СтоимостьКупонаВВалютеУчетаНачальныйОстаток,
	|	СУММА(_ПартииВременная.ПереоценкаКупонаВВалютеУчетаНачальныйОстаток) КАК ПереоценкаКупонаВВалютеУчетаНачальныйОстаток,
	|	СУММА(_ПартииВременная.КоличествоПриход) КАК КоличествоПриход,
	|	СУММА(_ПартииВременная.СтоимостьКупонаВВалютеУчетаПриход) КАК СтоимостьКупонаВВалютеУчетаПриход,
	|	СУММА(_ПартииВременная.ПереоценкаКупонаВВалютеУчетаПриход) КАК ПереоценкаКупонаВВалютеУчетаПриход,
	|	СУММА(_ПартииВременная.КоличествоРасход) КАК КоличествоРасход,
	|	СУММА(_ПартииВременная.СтоимостьКупонаВВалютеУчетаРасход) КАК СтоимостьКупонаВВалютеУчетаРасход,
	|	СУММА(_ПартииВременная.ПереоценкаКупонаВВалютеУчетаРасход) КАК ПереоценкаКупонаВВалютеУчетаРасход,
	|	СУММА(_ПартииВременная.КоличествоКонечныйОстаток) КАК КоличествоКонечныйОстаток,
	|	СУММА(_ПартииВременная.СтоимостьКупонаВВалютеУчетаКонечныйОстаток) КАК СтоимостьКупонаВВалютеУчетаКонечныйОстаток,
	|	_ПартииВременная.ДатаПартии КАК ДатаПартии,
	|	_ПартииВременная.Регистратор КАК Регистратор,
	|	_ПартииВременная.Период КАК Период,
	|	_ПартииВременная.МоментВремени КАК МоментВремени
	|ПОМЕСТИТЬ _ПартииСГруппировкой
	|ИЗ
	|	_ПартииВременная КАК _ПартииВременная
	|
	|СГРУППИРОВАТЬ ПО
	|	_ПартииВременная.ЦеннаяБумага,
	|	_ПартииВременная.Партия,
	|	_ПартииВременная.ДатаПартии,
	|	_ПартииВременная.Регистратор,
	|	_ПартииВременная.Период,
	|	_ПартииВременная.МоментВремени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ПартииСГруппировкой.ЦеннаяБумага КАК ЦеннаяБумага,
	|	МАКСИМУМ(_ПартииСГруппировкой.Период) КАК Период,
	|	МАКСИМУМ(_ПартииСГруппировкой.Партия) КАК Партия,
	|	МАКСИМУМ(_ПартииСГруппировкой.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ _ПоследниеРегистраторы
	|ИЗ
	|	_ПартииСГруппировкой КАК _ПартииСГруппировкой
	|ГДЕ
	|	_ПартииСГруппировкой.Регистратор ЕСТЬ НЕ NULL 
	|	И ТИПЗНАЧЕНИЯ(_ПартииСГруппировкой.Регистратор) <> ТИП(Документ.ПереоценкаЦенныхБумаг)
	|
	|СГРУППИРОВАТЬ ПО
	|	_ПартииСГруппировкой.ЦеннаяБумага,
	|	НАЧАЛОПЕРИОДА(_ПартииСГруппировкой.Период, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ПартииСГруппировкой.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_ПартииСГруппировкой.Партия КАК Партия,
	|	_ПартииСГруппировкой.ДатаПартии КАК ДатаПартии,
	|	_ПартииСГруппировкой.Регистратор КАК Регистратор,
	|	_ПартииСГруппировкой.Период КАК Период,
	|	СУММА(_ПартииСГруппировкой.КоличествоНачальныйОстаток + ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.КоличествоНачальныйОстаток, 0) + ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.КоличествоПриход, 0) - ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.КоличествоРасход, 0)) КАК КоличествоНачальныйОстаток,
	|	_ПартииСГруппировкой.КоличествоПриход КАК КоличествоПриход,
	|	_ПартииСГруппировкой.КоличествоРасход КАК КоличествоРасход,
	|	СУММА(_ПартииСГруппировкой.КоличествоНачальныйОстаток + ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.КоличествоНачальныйОстаток, 0) + ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.КоличествоПриход, 0) - ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.КоличествоРасход, 0)) + _ПартииСГруппировкой.КоличествоПриход - _ПартииСГруппировкой.КоличествоРасход КАК КоличествоКонечныйОстаток,
	|	СУММА(_ПартииСГруппировкой.СтоимостьКупонаВВалютеУчетаНачальныйОстаток + ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.СтоимостьКупонаВВалютеУчетаНачальныйОстаток, 0) + ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.СтоимостьКупонаВВалютеУчетаПриход, 0) - ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.СтоимостьКупонаВВалютеУчетаРасход, 0)) КАК СтоимостьКупонаВВалютеУчетаНачальныйОстаток,
	|	_ПартииСГруппировкой.СтоимостьКупонаВВалютеУчетаПриход КАК СтоимостьКупонаВВалютеУчетаПриход,
	|	_ПартииСГруппировкой.СтоимостьКупонаВВалютеУчетаРасход КАК СтоимостьКупонаВВалютеУчетаРасход,
	|	СУММА(_ПартииСГруппировкой.СтоимостьКупонаВВалютеУчетаНачальныйОстаток + ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.СтоимостьКупонаВВалютеУчетаНачальныйОстаток, 0) + ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.СтоимостьКупонаВВалютеУчетаПриход, 0) - ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.СтоимостьКупонаВВалютеУчетаРасход, 0)) + _ПартииСГруппировкой.СтоимостьКупонаВВалютеУчетаПриход - _ПартииСГруппировкой.СтоимостьКупонаВВалютеУчетаРасход КАК СтоимостьКупонаВВалютеУчетаКонечныйОстаток,
	|	СУММА(_ПартииСГруппировкой.ПереоценкаКупонаВВалютеУчетаНачальныйОстаток + ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.ПереоценкаКупонаВВалютеУчетаНачальныйОстаток, 0) + ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.ПереоценкаКупонаВВалютеУчетаПриход, 0) - ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.ПереоценкаКупонаВВалютеУчетаРасход, 0)) КАК ПереоценкаКупонаВВалютеУчетаНачальныйОстаток,
	|	_ПартииСГруппировкой.ПереоценкаКупонаВВалютеУчетаПриход КАК ПереоценкаКупонаВВалютеУчетаПриход,
	|	_ПартииСГруппировкой.ПереоценкаКупонаВВалютеУчетаРасход КАК ПереоценкаКупонаВВалютеУчетаРасход,
	|	СУММА(_ПартииСГруппировкой.ПереоценкаКупонаВВалютеУчетаНачальныйОстаток + ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.ПереоценкаКупонаВВалютеУчетаНачальныйОстаток, 0) + ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.ПереоценкаКупонаВВалютеУчетаПриход, 0) - ЕСТЬNULL(_ПартииСГруппировкойНарастающимИтогом.ПереоценкаКупонаВВалютеУчетаРасход, 0)) + _ПартииСГруппировкой.ПереоценкаКупонаВВалютеУчетаПриход - _ПартииСГруппировкой.ПереоценкаКупонаВВалютеУчетаРасход КАК ПереоценкаКупонаВВалютеУчетаКонечныйОстаток
	|ПОМЕСТИТЬ _ПартииНарастающимИтогом
	|ИЗ
	|	_ПартииСГруппировкой КАК _ПартииСГруппировкой
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ПартииСГруппировкой КАК _ПартииСГруппировкойНарастающимИтогом
	|		ПО _ПартииСГруппировкой.ЦеннаяБумага = _ПартииСГруппировкойНарастающимИтогом.ЦеннаяБумага
	|			И _ПартииСГруппировкой.Партия = _ПартииСГруппировкойНарастающимИтогом.Партия
	|			И _ПартииСГруппировкой.ДатаПартии = _ПартииСГруппировкойНарастающимИтогом.ДатаПартии
	|			И (_ПартииСГруппировкойНарастающимИтогом.МоментВремени < _ПартииСГруппировкой.МоментВремени)
	|
	|СГРУППИРОВАТЬ ПО
	|	_ПартииСГруппировкой.ЦеннаяБумага,
	|	_ПартииСГруппировкой.Партия,
	|	_ПартииСГруппировкой.ДатаПартии,
	|	_ПартииСГруппировкой.Регистратор,
	|	_ПартииСГруппировкой.Период,
	|	_ПартииСГруппировкой.КоличествоПриход,
	|	_ПартииСГруппировкой.КоличествоРасход,
	|	_ПартииСГруппировкой.КоличествоКонечныйОстаток,
	|	_ПартииСГруппировкой.СтоимостьКупонаВВалютеУчетаПриход,
	|	_ПартииСГруппировкой.СтоимостьКупонаВВалютеУчетаРасход,
	|	_ПартииСГруппировкой.ПереоценкаКупонаВВалютеУчетаПриход,
	|	_ПартииСГруппировкой.ПереоценкаКупонаВВалютеУчетаРасход
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ПартииНарастающимИтогом.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_ПартииНарастающимИтогом.Партия КАК Партия,
	|	_ПартииНарастающимИтогом.ДатаПартии КАК ДатаПартии,
	|	_ПартииНарастающимИтогом.Регистратор КАК Регистратор,
	|	_ПартииНарастающимИтогом.Период КАК Период,
	|	_ПартииНарастающимИтогом.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	_ПартииНарастающимИтогом.КоличествоПриход КАК КоличествоПриход,
	|	_ПартииНарастающимИтогом.КоличествоРасход КАК КоличествоРасход,
	|	ВЫБОР
	|		КОГДА _ПартииНарастающимИтогом.Регистратор ЕСТЬ НЕ NULL 
	|				И _ПоследниеРегистраторы.Регистратор ЕСТЬ NULL
	|				И ТИПЗНАЧЕНИЯ(_ПартииНарастающимИтогом.Регистратор) <> ТИП(Документ.ПереоценкаЦенныхБумаг)
	|			ТОГДА 0
	|		ИНАЧЕ _ПартииНарастающимИтогом.КоличествоКонечныйОстаток
	|	КОНЕЦ КАК КоличествоКонечныйОстаток,
	|	_ПартииНарастающимИтогом.СтоимостьКупонаВВалютеУчетаНачальныйОстаток КАК СтоимостьКупонаВВалютеУчетаНачальныйОстаток,
	|	_ПартииНарастающимИтогом.СтоимостьКупонаВВалютеУчетаПриход КАК СтоимостьКупонаВВалютеУчетаПриход,
	|	_ПартииНарастающимИтогом.СтоимостьКупонаВВалютеУчетаРасход КАК СтоимостьКупонаВВалютеУчетаРасход,
	|	ВЫБОР
	|		КОГДА _ПартииНарастающимИтогом.Регистратор ЕСТЬ НЕ NULL 
	|				И _ПоследниеРегистраторы.Регистратор ЕСТЬ NULL
	|				И ТИПЗНАЧЕНИЯ(_ПартииНарастающимИтогом.Регистратор) <> ТИП(Документ.ПереоценкаЦенныхБумаг)
	|			ТОГДА 0
	|		ИНАЧЕ _ПартииНарастающимИтогом.СтоимостьКупонаВВалютеУчетаКонечныйОстаток
	|	КОНЕЦ КАК СтоимостьКупонаВВалютеУчетаКонечныйОстаток,
	|	_ПартииНарастающимИтогом.ПереоценкаКупонаВВалютеУчетаНачальныйОстаток КАК ПереоценкаКупонаВВалютеУчетаНачальныйОстаток,
	|	_ПартииНарастающимИтогом.ПереоценкаКупонаВВалютеУчетаПриход КАК ПереоценкаКупонаВВалютеУчетаПриход,
	|	_ПартииНарастающимИтогом.ПереоценкаКупонаВВалютеУчетаРасход КАК ПереоценкаКупонаВВалютеУчетаРасход,
	|	ВЫБОР
	|		КОГДА _ПартииНарастающимИтогом.Регистратор ЕСТЬ НЕ NULL 
	|				И _ПоследниеРегистраторы.Регистратор ЕСТЬ NULL
	|				И ТИПЗНАЧЕНИЯ(_ПартииНарастающимИтогом.Регистратор) <> ТИП(Документ.ПереоценкаЦенныхБумаг)
	|			ТОГДА 0
	|		ИНАЧЕ _ПартииНарастающимИтогом.ПереоценкаКупонаВВалютеУчетаКонечныйОстаток
	|	КОНЕЦ КАК ПереоценкаКупонаВВалютеУчетаКонечныйОстаток
	|ПОМЕСТИТЬ _ПартииНарастающимИтогомКорректировка
	|ИЗ
	|	_ПартииНарастающимИтогом КАК _ПартииНарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ПоследниеРегистраторы КАК _ПоследниеРегистраторы
	|		ПО _ПартииНарастающимИтогом.ЦеннаяБумага = _ПоследниеРегистраторы.ЦеннаяБумага
	|			И _ПартииНарастающимИтогом.Партия = _ПоследниеРегистраторы.Партия
	|			И _ПартииНарастающимИтогом.Регистратор = _ПоследниеРегистраторы.Регистратор
	|			И (НАЧАЛОПЕРИОДА(_ПартииНарастающимИтогом.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(_ПоследниеРегистраторы.Период, ДЕНЬ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ПартииНарастающимИтогом.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_ПартииНарастающимИтогом.Партия КАК Партия,
	|	_ПартииНарастающимИтогом.ДатаПартии КАК ДатаПартии,
	|	_ПартииНарастающимИтогом.Регистратор КАК Регистратор,
	|	_ПартииНарастающимИтогом.Период КАК Период,
	|	_ПартииНарастающимИтогом.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	_ПартииНарастающимИтогом.СтоимостьКупонаВВалютеУчетаНачальныйОстаток + _ПартииНарастающимИтогом.ПереоценкаКупонаВВалютеУчетаНачальныйОстаток КАК СтоимостьКупонаНачальныйОстаток,
	|	_ПартииНарастающимИтогом.КоличествоПриход КАК КоличествоПриход,
	|	_ПартииНарастающимИтогом.СтоимостьКупонаВВалютеУчетаПриход КАК СтоимостьКупонаВВалютеУчетаПриход,
	|	_ПартииНарастающимИтогом.КоличествоРасход КАК КоличествоРасход,
	|	_ПартииНарастающимИтогом.СтоимостьКупонаВВалютеУчетаРасход КАК СтоимостьКупонаВВалютеУчетаРасход,
	|	_ПартииНарастающимИтогом.ПереоценкаКупонаВВалютеУчетаРасход КАК ПереоценкаКупонаВВалютеУчетаРасход,
	|	_ПартииНарастающимИтогом.СтоимостьКупонаВВалютеУчетаКонечныйОстаток + _ПартииНарастающимИтогом.ПереоценкаКупонаВВалютеУчетаКонечныйОстаток КАК СтоимостьКупонаКонечныйОстаток,
	|	_ПартииНарастающимИтогом.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток
	|ПОМЕСТИТЬ _Партии
	|ИЗ
	|	_ПартииНарастающимИтогомКорректировка КАК _ПартииНарастающимИтогом
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеннаяБумага,
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НалоговыйУчетОбороты.Субконто2 КАК ЦеннаяБумага,
	|	НалоговыйУчетОбороты.Период КАК ДатаОперации,
	|	СУММА(НалоговыйУчетОбороты.СуммаОборотКт) КАК СуммаДохода,
	|	_АналитикиДоходов.Операция КАК Операция,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(НалоговыйУчетОбороты.Субконто2 КАК Справочник.Облигации).Категория В (ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Ипотечная))
	|			ТОГДА ВЫБОР
	|					КОГДА НалоговыйУчетОбороты.Субконто3 = ЗНАЧЕНИЕ(Перечисление.ВидыОбращенияНаОРЦБ.Обращается)
	|							И ВЫРАЗИТЬ(НалоговыйУчетОбороты.Субконто2 КАК Справочник.Облигации).ДатаНачалаРазмещения >= ДАТАВРЕМЯ(2017, 1, 1)
	|							И РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|						ТОГДА ""Корп15""
	|					ИНАЧЕ ""Корп20""
	|				КОНЕЦ
	|		ИНАЧЕ ""Гос""
	|	КОНЕЦ КАК Раздел,
	|	НалоговыйУчетОбороты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ _Доходы
	|ИЗ
	|	РегистрБухгалтерии.НалоговыйУчет.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы),
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДУ
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						_АналитикиДоходов.Аналитика
	|					ИЗ
	|						_АналитикиДоходов)
	|				И Субконто2 В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						_Партии.ЦеннаяБумага
	|					ИЗ
	|						_Партии КАК _Партии),
	|			,
	|			) КАК НалоговыйУчетОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _АналитикиДоходов КАК _АналитикиДоходов
	|		ПО НалоговыйУчетОбороты.Субконто1 = _АналитикиДоходов.Аналитика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	|				&КонецПериода,
	|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО (ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(НалоговыйУчетОбороты.Субконто2) = ТИП(Справочник.Облигации)
	|					ТОГДА ВЫРАЗИТЬ(НалоговыйУчетОбороты.Субконто2 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
	|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
	|
	|СГРУППИРОВАТЬ ПО
	|	НалоговыйУчетОбороты.Субконто2,
	|	НалоговыйУчетОбороты.Период,
	|	_АналитикиДоходов.Операция,
	|	НалоговыйУчетОбороты.Субконто3,
	|	НалоговыйУчетОбороты.Регистратор,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(НалоговыйУчетОбороты.Субконто2 КАК Справочник.Облигации).Категория В (ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Ипотечная))
	|			ТОГДА ВЫБОР
	|					КОГДА НалоговыйУчетОбороты.Субконто3 = ЗНАЧЕНИЕ(Перечисление.ВидыОбращенияНаОРЦБ.Обращается)
	|							И ВЫРАЗИТЬ(НалоговыйУчетОбороты.Субконто2 КАК Справочник.Облигации).ДатаНачалаРазмещения >= ДАТАВРЕМЯ(2017, 1, 1)
	|							И РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|						ТОГДА ""Корп15""
	|					ИНАЧЕ ""Корп20""
	|				КОНЕЦ
	|		ИНАЧЕ ""Гос""
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеннаяБумага,
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НормыЗаконодательстваСрезПоследних.СрокДействияКотировокДляОРЦБ КАК СрокДействияКотировокДляОРЦБ
	|ПОМЕСТИТЬ _СрокДействияКотировок
	|ИЗ
	|	РегистрСведений.НормыЗаконодательства.СрезПоследних(&КонецПериода, ) КАК НормыЗаконодательстваСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&КонецПериода КАК Период,
	|	КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
	|	МАКСИМУМ(КотировкиТорговыхПлощадокСводныеСрезПоследних.WAPRICE_DATE) КАК ДатаКотировки
	|ПОМЕСТИТЬ _ОбращаемостьЦБНетДвиженийПо91счету
	|ИЗ
	|	РегистрСведений.КотировкиТорговыхПлощадокСводные.СрезПоследних(
	|			&КонецПериода,
	|			Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
	|				И Биржа = &ММВБ
	|				И НЕ РежимТоргов.РЕПО
	|				И НЕ РежимТоргов.ПервичноеРазмещение
	|				И НЕ РежимТоргов.ВыкупЭмитентом
	|				И ЦеннаяБумага В
	|					(ВЫБРАТЬ
	|						_Партии.ЦеннаяБумага КАК ЦеннаяБумага
	|					ИЗ
	|						_Партии КАК _Партии
	|					ГДЕ
	|						НЕ _Партии.ЦеннаяБумага В
	|								(ВЫБРАТЬ
	|									_Доходы.ЦеннаяБумага КАК ЦеннаяБумага
	|								ИЗ
	|									_Доходы КАК _Доходы))) КАК КотировкиТорговыхПлощадокСводныеСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ _СрокДействияКотировок КАК _СрокДействияКотировок
	|		ПО (ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	_Партии.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВЫБОР
	|		КОГДА _Доходы.Раздел ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(_Партии.ЦеннаяБумага КАК Справочник.Облигации).Категория В (ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Ипотечная))
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(_ОбращаемостьЦБНетДвиженийПо91счету.ДатаКотировки, ДАТАВРЕМЯ(2000, 1, 1)) >= ДОБАВИТЬКДАТЕ(&КонецПериода, МЕСЯЦ, -ЕСТЬNULL(_СрокДействияКотировок.СрокДействияКотировокДляОРЦБ, 0))
	|									ТОГДА ""Корп15""
	|								ИНАЧЕ ""Корп20""
	|							КОНЕЦ
	|					ИНАЧЕ ""Гос""
	|				КОНЕЦ
	|		ИНАЧЕ _Доходы.Раздел
	|	КОНЕЦ КАК Раздел
	|ПОМЕСТИТЬ _ПараметрыЦенныхБумаг
	|ИЗ
	|	_Партии КАК _Партии
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Доходы КАК _Доходы
	|		ПО (_Доходы.ЦеннаяБумага = _Партии.ЦеннаяБумага)
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ОбращаемостьЦБНетДвиженийПо91счету КАК _ОбращаемостьЦБНетДвиженийПо91счету
	|			ЛЕВОЕ СОЕДИНЕНИЕ _СрокДействияКотировок КАК _СрокДействияКотировок
	|			ПО (ИСТИНА)
	|		ПО _Партии.ЦеннаяБумага = _ОбращаемостьЦБНетДвиженийПо91счету.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Партии.Регистратор КАК Регистратор,
	|	_Партии.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СУММА(_Партии.КоличествоНачальныйОстаток) КАК КоличествоНачальныйОстаток,
	|	СУММА(_Партии.КоличествоРасход) КАК КоличествоРасход,
	|	СУММА(_Партии.КоличествоПриход) КАК КоличествоПриход,
	|	СУММА(_Партии.КоличествоКонечныйОстаток) КАК КоличествоКонечныйОстаток
	|ПОМЕСТИТЬ _ОстаткиЦБНадатуОперации
	|ИЗ
	|	_Партии КАК _Партии
	|
	|СГРУППИРОВАТЬ ПО
	|	_Партии.Регистратор,
	|	_Партии.ЦеннаяБумага
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ПараметрыЦенныхБумаг.Раздел КАК Раздел,
	|	_Партии.ДатаПартии КАК ДатаПартии,
	|	_Партии.Период КАК Период,
	|	_Партии.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_Партии.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	_Партии.СтоимостьКупонаНачальныйОстаток КАК СтоимостьКупонаНачальныйОстаток,
	|	_Партии.КоличествоПриход КАК КоличествоПриход,
	|	_Партии.СтоимостьКупонаВВалютеУчетаПриход КАК СтоимостьКупонаВВалютеУчетаПриход,
	|	_Партии.КоличествоРасход КАК КоличествоРасход,
	|	_Партии.СтоимостьКупонаВВалютеУчетаРасход КАК СтоимостьКупонаВВалютеУчетаРасход,
	|	_Партии.ПереоценкаКупонаВВалютеУчетаРасход КАК ПереоценкаКупонаВВалютеУчетаРасход,
	|	_Партии.СтоимостьКупонаКонечныйОстаток КАК СтоимостьКупонаКонечныйОстаток,
	|	_Партии.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	ЕСТЬNULL(_Доходы.Операция, """") КАК Операция,
	|	ЕСТЬNULL(_Доходы.СуммаДохода, 0) КАК Доход,
	|	ВЫБОР
	|		КОГДА _Доходы.Операция = ""Погашение""
	|			ТОГДА ЕСТЬNULL(_Доходы.СуммаДохода, 0) * _Партии.КоличествоНачальныйОстаток / _ОстаткиЦБНадатуОперации.КоличествоНачальныйОстаток
	|		КОГДА _Доходы.Операция = ""Реализация""
	|			ТОГДА ЕСТЬNULL(_Доходы.СуммаДохода, 0) * _Партии.КоличествоРасход / _ОстаткиЦБНадатуОперации.КоличествоРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПолученоНКД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(_Доходы.СуммаДохода, 0) = 0
	|			ТОГДА 0
	|		КОГДА _Доходы.Операция = ""Переоценка""
	|			ТОГДА _Партии.СтоимостьКупонаКонечныйОстаток - _Партии.СтоимостьКупонаНачальныйОстаток
	|		КОГДА _Доходы.Операция = ""Реализация""
	|			ТОГДА ЕСТЬNULL(_Доходы.СуммаДохода, 0) * _Партии.КоличествоРасход / _ОстаткиЦБНадатуОперации.КоличествоРасход - _Партии.СтоимостьКупонаНачальныйОстаток * _Партии.КоличествоРасход / _Партии.КоличествоНачальныйОстаток
	|		КОГДА _Доходы.Операция = ""Погашение""
	|			ТОГДА ЕСТЬNULL(_Доходы.СуммаДохода, 0) * _Партии.КоличествоНачальныйОстаток / _ОстаткиЦБНадатуОперации.КоличествоНачальныйОстаток - _Партии.СтоимостьКупонаНачальныйОстаток
	|	КОНЕЦ КАК Прибыль
	|ПОМЕСТИТЬ _Базис
	|ИЗ
	|	_Партии КАК _Партии
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Доходы КАК _Доходы
	|		ПО _Партии.ЦеннаяБумага = _Доходы.ЦеннаяБумага
	|			И _Партии.Регистратор = _Доходы.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиЦБНадатуОперации КАК _ОстаткиЦБНадатуОперации
	|		ПО _Партии.ЦеннаяБумага = _ОстаткиЦБНадатуОперации.ЦеннаяБумага
	|			И _Партии.Регистратор = _ОстаткиЦБНадатуОперации.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ПараметрыЦенныхБумаг КАК _ПараметрыЦенныхБумаг
	|		ПО _Партии.ЦеннаяБумага = _ПараметрыЦенныхБумаг.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Базис.Раздел КАК Раздел,
	|	_Базис.ДатаПартии КАК ДатаПартии,
	|	_Базис.ЦеннаяБумага КАК ЦеннаяБумага,
	|	НАЧАЛОПЕРИОДА(_Базис.Период, ДЕНЬ) КАК Период,
	|	СУММА(_Базис.КоличествоРасход) КАК КоличествоРасход,
	|	СУММА(_Базис.ПолученоНКД) КАК ПолученоНКД,
	|	СУММА(_Базис.Прибыль) КАК Прибыль
	|ПОМЕСТИТЬ _ДвиженияДоход
	|ИЗ
	|	_Базис КАК _Базис
	|ГДЕ
	|	_Базис.Период <> &НачалоПериода
	|	И _Базис.Период <> &КонецПериода
	|	И _Базис.Операция <> ""Переоценка""
	|	И _Базис.КоличествоПриход = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	_Базис.Раздел,
	|	_Базис.ДатаПартии,
	|	_Базис.ЦеннаяБумага,
	|	НАЧАЛОПЕРИОДА(_Базис.Период, ДЕНЬ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Базис.ДатаПартии КАК ДатаПартии,
	|	_Базис.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СУММА(_Базис.КоличествоПриход) КАК КоличествоПриход,
	|	СУММА(_Базис.СтоимостьКупонаВВалютеУчетаПриход) КАК СтоимостьКупонаПриход
	|ПОМЕСТИТЬ _ДвиженияПриход
	|ИЗ
	|	_Базис КАК _Базис
	|ГДЕ
	|	_Базис.Период <> &НачалоПериода
	|	И _Базис.Период <> &КонецПериода
	|	И _Базис.Операция <> ""Переоценка""
	|	И _Базис.КоличествоПриход > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	_Базис.ДатаПартии,
	|	_Базис.ЦеннаяБумага
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеннаяБумага,
	|	ДатаПартии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Базис.ДатаПартии КАК ДатаПартии,
	|	_Базис.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СУММА(_Базис.Прибыль) КАК Прибыль
	|ПОМЕСТИТЬ _Переоценка
	|ИЗ
	|	_Базис КАК _Базис
	|ГДЕ
	|	_Базис.Операция = ""Переоценка""
	|
	|СГРУППИРОВАТЬ ПО
	|	_Базис.ДатаПартии,
	|	_Базис.ЦеннаяБумага
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДатаПартии,
	|	ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	_Партии.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_Партии.Партия КАК Партия,
	|	МИНИМУМ(_Партии.Период) КАК ПериодМинимум,
	|	МАКСИМУМ(_Партии.Период) КАК ПериодМаксимум
	|ПОМЕСТИТЬ _ГраницыПериодовПартий
	|ИЗ
	|	_Партии КАК _Партии
	|
	|СГРУППИРОВАТЬ ПО
	|	_Партии.ЦеннаяБумага,
	|	_Партии.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	_ПартииСуммаНаНачало.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_ПартииСуммаНаНачало.Партия КАК Партия,
	|	_ПартииСуммаНаНачало.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	0 КАК КоличествоКонечныйОстаток,
	|	_ПартииСуммаНаНачало.СтоимостьКупонаНачальныйОстаток КАК СтоимостьКупонаНачальныйОстаток,
	|	0 КАК СтоимостьКупонаКонечныйОстаток,
	|	_ПартииСуммаНаНачало.ДатаПартии КАК ДатаПартии
	|ПОМЕСТИТЬ _НачалоКонецПредварительно
	|ИЗ
	|	_Партии КАК _ПартииСуммаНаНачало
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ГраницыПериодовПартий КАК _ГраницыПериодовПартий
	|		ПО _ПартииСуммаНаНачало.ЦеннаяБумага = _ГраницыПериодовПартий.ЦеннаяБумага
	|			И _ПартииСуммаНаНачало.Партия = _ГраницыПериодовПартий.Партия
	|			И _ПартииСуммаНаНачало.Период = _ГраницыПериодовПартий.ПериодМинимум
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_ПартииСуммаНаОкончание.ЦеннаяБумага,
	|	_ПартииСуммаНаОкончание.Партия,
	|	0,
	|	_ПартииСуммаНаОкончание.КоличествоКонечныйОстаток,
	|	0,
	|	_ПартииСуммаНаОкончание.СтоимостьКупонаКонечныйОстаток,
	|	_ПартииСуммаНаОкончание.ДатаПартии
	|ИЗ
	|	_Партии КАК _ПартииСуммаНаОкончание
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ГраницыПериодовПартий КАК _ГраницыПериодовПартий
	|		ПО _ПартииСуммаНаОкончание.ЦеннаяБумага = _ГраницыПериодовПартий.ЦеннаяБумага
	|			И _ПартииСуммаНаОкончание.Партия = _ГраницыПериодовПартий.Партия
	|			И _ПартииСуммаНаОкончание.Период = _ГраницыПериодовПартий.ПериодМаксимум
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	_НачалоКонецПредварительно.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СУММА(_НачалоКонецПредварительно.КоличествоНачальныйОстаток) КАК КоличествоНачальныйОстаток,
	|	СУММА(_НачалоКонецПредварительно.СтоимостьКупонаНачальныйОстаток) КАК СтоимостьКупонаНачальныйОстаток,
	|	СУММА(_НачалоКонецПредварительно.СтоимостьКупонаКонечныйОстаток) КАК СтоимостьКупонаКонечныйОстаток,
	|	СУММА(_НачалоКонецПредварительно.КоличествоКонечныйОстаток) КАК КоличествоКонечныйОстаток,
	|	_НачалоКонецПредварительно.ДатаПартии КАК ДатаПартии,
	|	_ПараметрыЦенныхБумаг.Раздел КАК Раздел
	|ПОМЕСТИТЬ _НачалоКонец
	|ИЗ
	|	_НачалоКонецПредварительно КАК _НачалоКонецПредварительно
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ПараметрыЦенныхБумаг КАК _ПараметрыЦенныхБумаг
	|		ПО _НачалоКонецПредварительно.ЦеннаяБумага = _ПараметрыЦенныхБумаг.ЦеннаяБумага
	|
	|СГРУППИРОВАТЬ ПО
	|	_НачалоКонецПредварительно.ЦеннаяБумага,
	|	_НачалоКонецПредварительно.ДатаПартии,
	|	_ПараметрыЦенныхБумаг.Раздел
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Остатки"" КАК Таблица,
	|	_НачалоКонец.Раздел КАК Раздел,
	|	_НачалоКонец.ДатаПартии КАК ДатаПартии,
	|	_НачалоКонец.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_НачалоКонец.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.Наименование) + "", "" + ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(_НачалоКонец.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер <> """"
	|			ТОГДА ВЫРАЗИТЬ(_НачалоКонец.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
	|		ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
	|	КОНЕЦ + "", "" + ВЫРАЗИТЬ(_НачалоКонец.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала.Наименование КАК ЦеннаяБумагаНаименование,
	|	_НачалоКонец.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	_НачалоКонец.СтоимостьКупонаНачальныйОстаток КАК СтоимостьКупонаНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА _НачалоКонец.ДатаПартии = &НачалоПериода
	|			ТОГДА 0
	|		ИНАЧЕ _ДвиженияПриход.КоличествоПриход
	|	КОНЕЦ КАК КоличествоПриход,
	|	ВЫБОР
	|		КОГДА _НачалоКонец.ДатаПартии = &НачалоПериода
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ _НачалоКонец.ДатаПартии
	|	КОНЕЦ КАК ПериодПриход,
	|	ЕСТЬNULL(_ДвиженияПриход.СтоимостьКупонаПриход, 0) КАК СтоимостьКупонаПриход,
	|	0 КАК КоличествоРасход,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодРасход,
	|	0 КАК ПолученоНКД,
	|	_НачалоКонец.СтоимостьКупонаКонечныйОстаток КАК СтоимостьКупонаКонечныйОстаток,
	|	ЕСТЬNULL(_Переоценка.Прибыль, 0) КАК Прибыль
	|ИЗ
	|	_НачалоКонец КАК _НачалоКонец
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	|				&КонецПериода,
	|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО (ВЫРАЗИТЬ(_НачалоКонец.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&КонецПериода, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследнихISIN
	|		ПО _НачалоКонец.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихISIN.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&КонецПериода, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахСрезПоследнихКодНаММВБ
	|		ПО _НачалоКонец.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Переоценка КАК _Переоценка
	|		ПО _НачалоКонец.ЦеннаяБумага = _Переоценка.ЦеннаяБумага
	|			И _НачалоКонец.ДатаПартии = _Переоценка.ДатаПартии
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ДвиженияПриход КАК _ДвиженияПриход
	|		ПО _НачалоКонец.ЦеннаяБумага = _ДвиженияПриход.ЦеннаяБумага
	|			И _НачалоКонец.ДатаПартии = _ДвиженияПриход.ДатаПартии
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Движения"",
	|	_Движения.Раздел,
	|	_Движения.ДатаПартии,
	|	_Движения.ЦеннаяБумага,
	|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Движения.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.Наименование) + "", "" + ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(_Движения.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер <> """"
	|			ТОГДА ВЫРАЗИТЬ(_Движения.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
	|		ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
	|	КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Движения.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала.Наименование,
	|	0,
	|	0,
	|	0,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	0,
	|	_Движения.КоличествоРасход,
	|	_Движения.Период,
	|	_Движения.ПолученоНКД,
	|	0,
	|	_Движения.Прибыль
	|ИЗ
	|	_ДвиженияДоход КАК _Движения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	|				&КонецПериода,
	|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
	|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
	|		ПО (ВЫРАЗИТЬ(_Движения.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&КонецПериода, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследнихISIN
	|		ПО _Движения.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихISIN.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&КонецПериода, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахСрезПоследнихКодНаММВБ
	|		ПО _Движения.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Раздел,
	|	ЦеннаяБумага,
	|	ДатаПартии,
	|	Таблица УБЫВ
	|ИТОГИ
	|	СУММА(КоличествоНачальныйОстаток),
	|	СУММА(СтоимостьКупонаНачальныйОстаток),
	|	СУММА(КоличествоПриход),
	|	СУММА(СтоимостьКупонаПриход),
	|	СУММА(КоличествоРасход),
	|	СУММА(ПолученоНКД),
	|	СУММА(СтоимостьКупонаКонечныйОстаток),
	|	СУММА(Прибыль)
	|ПО
	|	Раздел,
	|	ЦеннаяБумага";
	
	
	//МассивКорпоративные = Новый Массив;
	//МассивКорпоративные.Добавить(Перечисления.КатегорииОблигаций.Корпоративная);
	//МассивКорпоративные.Добавить(Перечисления.КатегорииОблигаций.Еврооблигация);
	//МассивКорпоративные.Добавить(Перечисления.КатегорииОблигаций.Ипотечная);
	//
	//МассивАктивов = Новый Массив; 
	//МассивАктивов.Добавить(Справочники.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон);
	//МассивАктивов.Добавить(Справочники.УчетныеАктивы.ОблигацииКорпоративныеКупон);
	//МассивАктивов.Добавить(Справочники.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалютеКупон);
	
	
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДУ", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Блумберг", ОбщегоНазначения.ПолучитьИменованныйОбъект("Bloomberg"));
	Запрос.УстановитьПараметр("ММВБ",ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));
	//Запрос.УстановитьПараметр("Корпоративные", МассивКорпоративные);
	//Запрос.УстановитьПараметр("СписокАктивов", МассивАктивов);
	
	Результат = Запрос.Выполнить();
	Возврат Результат;
		
КонецФункции	

Функция ПараметрыРаздела(Раздел, Дата)
	
	Результат = Новый Структура("НазваниеРаздела, Ставка, Документ");
	
	Если Дата >= '20250101' Тогда 
		Инкримент = 5;
	Иначе         
		Инкримент = 0;
	КонецЕсли;
	
	Если Раздел = "Гос" Тогда
		Результат.Вставить("НазваниеРаздела","Отчет о доходах в виде процентов по государственным и муниципальным ценным бумагам");
		Результат.Вставить("Ставка", 15 + Инкримент);
		Результат.Вставить("Документ","ДокументГос");
	ИначеЕсли Раздел = "Корп15" Тогда 
		Результат.Вставить("НазваниеРаздела","Отчет о процентных доходах по корпоративным облигациям");
		Результат.Вставить("Ставка", 15 + Инкримент);
		Результат.Вставить("Документ","ДокументКорп15");
	ИначеЕсли Раздел = "Корп20" Тогда 
		Результат.Вставить("НазваниеРаздела","Отчет о процентных доходах по корпоративным облигациям");
		Результат.Вставить("Ставка", 20 + Инкримент);
		Результат.Вставить("Документ","ДокументКорп20");
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	

Процедура Сформировать(СписокДокументов) Экспорт
		
	// Фиксируем запуск процедуры
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".Сформировать()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период, Организация, СчетДоверительногоУправления");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Макет = ПолучитьМакет("Макет");
	
	Результат = РезультатЗапроса();
	
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//параметры шапки
	ПараметрыШапки = РаботаСОтчетами.ПолучитьПараметрыШапки(Период.ДатаОкончания, Организация, СчетДоверительногоУправления);
	
	ОбластьСтрокаЦБ = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрокаДвижение = Макет.ПолучитьОбласть("Строка2");
	
	
	//параметры подписей
	Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхРуководитель") Тогда
		СтруктураДанныхРуководитель = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СтруктураДанныхРуководитель;
	Иначе
		СтруктураДанныхРуководитель = Неопределено;
	КонецЕсли;	
	Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхГлавбух") Тогда
		СтруктураДанныхГлавбух = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СтруктураДанныхГлавбух;
	Иначе	
		СтруктураДанныхГлавбух = Неопределено;
	КонецЕсли;	
	
	Пока ВыборкаИтог.Следующий() Цикл 
		
		ПараметрыРаздела = ПараметрыРаздела(ВыборкаИтог.Раздел, Период.ДатаНачала);
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ПараметрыРаздела);	
		
		ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
		ОбластьШапка.Параметры.ПериодОтчета = ПредставлениеПериода(Период.ДатаНачала, Период.ДатаОкончания, "ФП=Истина");
		
		ДокументРезультат = СписокДокументов[ПараметрыРаздела.Документ];	
		ДокументРезультат.Вывести(ОбластьШапка); 		
		
		ВыборкаЦБ = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаЦБ.Следующий() Цикл 
				
			Выборка = ВыборкаЦБ.Выбрать();
			ПерваяСтрокаЦБ = Истина;
			Пока Выборка.Следующий() Цикл 
				
				Если Выборка.Таблица = "Остатки" И ПерваяСтрокаЦБ Тогда 
					ОбластьСтрока = ОбластьСтрокаЦБ; 
				ИначеЕсли Выборка.Таблица = "Движения" Тогда 
					ОбластьСтрока = ОбластьСтрокаДвижение;
				КонецЕсли;	
				
				ПерваяСтрокаЦБ = Ложь;
				
				ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Выборка);
				ДокументРезультат.Вывести(ОбластьСтрока);
				
			КонецЦикла;
								
		КонецЦикла;
		
		ОбластьИтог = Макет.ПолучитьОбласть("Итог");
		ЗаполнитьЗначенияСвойств(ОбластьИтог.Параметры, ВыборкаИтог);
		
		СуммаНалога= ВыборкаИтог.Прибыль * ПараметрыРаздела.Ставка/100;
		ОбластьФинРез = Макет.ПолучитьОбласть("ФинРез");
		ОбластьФинРез.Параметры.Ставка = ПараметрыРаздела.Ставка;
		ОбластьФинРез.Параметры.СуммаНалога= СуммаНалога;
			
		ДокументРезультат.Вывести(ОбластьИтог);
		ДокументРезультат.Вывести(ОбластьФинРез);		
		
		//подписи
		ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
		
		Если СтруктураДанныхРуководитель <> Неопределено Тогда 
			ОбластьПодписи.Параметры.ДолжностьРуководитель = СтруктураДанныхРуководитель.Должность + " (на основании " + СтруктураДанныхРуководитель.ОснованиеПолномочий +  ")";
			ОбластьПодписи.Параметры.Руководитель = СтруктураДанныхРуководитель.КонтактноеЛицо;
		КонецЕсли;
		Если СтруктураДанныхГлавбух <> Неопределено Тогда 	
			ОбластьПодписи.Параметры.ДолжностьГлавбух = СтруктураДанныхГлавбух.Должность;
			ОбластьПодписи.Параметры.ГлавБух = СтруктураДанныхГлавбух.КонтактноеЛицо;
		КонецЕсли;	
		
		ДокументРезультат.Вывести(ОбластьПодписи);
				
	КонецЦикла;	
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
